using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DaGame
{
    internal class DaBosss
    {
        public string BossName;
        public int BossMaxHP;
        public int BossHP;
        public int BossAttack;
        public int CoolAttackNumber;
        static Random random = new Random();
        static string[] Names = { "Красновострая виверна", "Углокрылая морозница", "Ядовзорный василиск", "Хвостопоглощающий змий" };
        static List<Action> CoolAttacks = new List<Action>();
        public static List<DaBosss> Boss = new List<DaBosss>() {};

        public static void Bosses()
        {
            CoolAttacks.Add(SummonAttack);
            CoolAttacks.Add(NegativeEffects);
            CoolAttacks.Add(AutoHill);
            CoolAttacks.Add(BossEvasion);
            CoolAttacks.Add(QTE);
            //CoolAttacks[0]();

            Boss.Add(new DaBosss() { BossName = Names[0], BossMaxHP = 50, BossHP = 50, BossAttack = 8, CoolAttackNumber = 0 });
            Boss.Add(new DaBosss() { BossName = Names[1], BossMaxHP = 50, BossHP = 50, BossAttack = 8, CoolAttackNumber = 1 });
            Boss.Add(new DaBosss() { BossName = Names[2], BossMaxHP = 50, BossHP = 50, BossAttack = 8, CoolAttackNumber = 2 });
            Boss.Add(new DaBosss() { BossName = Names[3], BossMaxHP = 50, BossHP = 50, BossAttack = 8, CoolAttackNumber = 3 });
        }
        static void SummonAttack()
        {
            int count = random.Next(1,4);
            for (int i = 0; i < count; i++)
			{
                enemy.ChooseEnemy(1);
			}            
        }

        static void NegativeEffects()
        {

        }

        static void AutoHill()
        {

        }

        static void BossEvasion()
        {

        }
        static void QTE()
        {

        }



        public static string Wyvern = @"

                '-.,;;:;,
                 _;\;|\;:;,
                ) __ ' \;::,
            .--'  e   ':;;;:,           ;,
           (^           ;;::;          ;;;,
   _        --_.--.___,',:;::;     ,,,;:;;;,
  < \        `;     |  ;:;;:;        ':;:;;;,,
<`-; \__     ,;    /    ';:;;:,       ';;;'
<`_   __',   ; ,  /    ::;;;:         //
   `)|  \ \   ` .'      ';;:;,       //
    `    \ `\  /        ;;:;;.      //__
          \  `/`         ;:;  ~._,=~`   `~=,
           \_|      (        ^     ^  ^ _^  \
             \    _,`      / ^ ^  ^   .' `.^ ;
    <`-.  jgs '-;`       /`  ^   ^  /\    ) ^/
    <'- \__..-'` ___,,,-'._ ^  ^ _.'\^`'-' ^/
     `)_   ..-''`          `~~~~`    `~===~`
     <_.-`-._\
";
        public static string Hellebore = @"
                             _        _
                         _.-'/   _.:'`/
                      ,'`   ( ,:;.-'`(
                    .'      .:'`      \
                   /       //    _.-';)
                 _/      _//_.-;:-'``/
          //|    \      \  .-'`      \                                 ,
         || /_,-,_|      | ```--..__  \                  .-'```'-.     )\
    _.--'_  '-;_/_)_     |(````'---.;`/-,.-.  _         /  .---.  \  .'  \
   /6    ^`     ':_/     | `-._    .-'../__ )' ',.-. _ |  /     \  ;/_ _/
  (`-----`--'.    \_)    ;|``-.;-./        ```--;.__) ',-.      (| |  ||
 __)         {\   |_/\   \\    _.'                  ``-;_ )'-,_(`/ ; _.'/
  /         {=|   |)  \.-`\\  /                          `'-.;_:'  /_.'
            {=|    \_.'    )) '        /                          /
            {=|     ,                 |      ,                _.-'
             {=;     ```--.            \    '.       __,.---'`
              {=\          `\           '._   '._.-``
       _,.--``;{\ '-.._    /        __,..-'-._ '.
       (((/==)/ _`;.--'`` .'--```````  .--````    )
        ```  ' (((/====```            ((((/======'
                ```                    ```
";
        public static string Basilisk = @"

                                     /|   /|
                                    / /  / /
                                   | |  | |
                                   ; /  ; /
                     ___  __      / .\_/ ,(   ___ 
                    /  {.' {     / ;;;/ ;;;```_.-'
                 .--'-./ .-'    / ;;;/ ;;' .-'
              _.-` _  `;;\_,   / ;;;/ .' ,/
          ,-`` ;-= g>=- .; /  / ;;;/ ;',;;|
           \`__/_     ; ';|  | ;;;/.',;;;;'\___,
     _    ,=,-V-' __  ;;  _\ /.;/`.`.'` .,:---'
     ``==`  |_.-'`  7_;;  | | ;|  .',;;;;;/
                   /_,;'  /  \'\ `,;;;;;;|
                  {_,;'^ _\  /;;).,,,,,`'\
                 {_;;' ^|   /;/`.;;;;;;;-'`
                {_,;'^  _\ //`.,..`_';/
               (__;;  ^  \/`.;;;;;( ',|  
               (__,;,^ .'`.;;,.`';;      _.-/
               (__,';,/ ,;'.`;;;,._\  _.'  ( 
                (__,';|/|;';;.';/` .-' _   /
                 (__,-';|; ;;;. |._  `//)_/
                  (_/ '- \,'``\ | `'.// 
                .-' |'-' '-'';|/ ^   ';
               /'-' | '-' '-' ;`;;.^   `\
              /  '-' \  '-' '/\_, ';,  ^ \
              |'-' .-'\-' '-'|  \_,';,  ^ \
         _     \  /    '.'-' \  //\_,; ^  |
       , _v\    \ |      \ '-( |;/ \_ ;   |
       v_\ `---_-' \      ;  / |;|  <_; ^ |
       (.-')(`` `'-'      | /  | ;`=';'  ;
        v</               ||    \ `'`  ^/
                          ||     '-...-'
                          ||
                     __  / |_
                   v-=_;` __ `)
                   v-(_.-'  `v
                      v

            ";
        public static string Serpent = @"
                     /\         /\__
                   // \       (  0 )_____/\            __
                  // \ \     (vv          o|          /^v\
                //    \ \   (vvvv  ___-----^        /^^/\vv\
              //  /     \ \ |vvvvv/               /^^/    \v\
             //  /       (\\/vvvv/              /^^/       \v\
            //  /  /  \ (  /vvvv/              /^^/---(     \v\
           //  /  /    \( /vvvv/----(O        /^^/           \v\
          //  /  /  \  (/vvvv/               /^^/             \v|
        //  /  /    \( vvvv/                /^^/               ||
       //  /  /    (  vvvv/                 |^^|              //
      //  / /    (  |vvvv|                  /^^/            //
     //  / /   (    \vvvvv\          )-----/^^/           //
    // / / (          \vvvvv\            /^^^/          //
   /// /(               \vvvvv\        /^^^^/          //
  ///(              )-----\vvvvv\    /^^^^/-----(      \\
 //(                        \vvvvv\/^^^^/               \\
/(                            \vvvv^^^/                 //
                                \vv^/         /        //
                                             /<______//
                                            <<<------/
                                             \<
                                               \
";
        public static string Leviathan = @"
           .-----------------------'\               /`----------.            
          /.-----------------------( \             / (`---------.\           
         //                       //\ \           //\_\          \\          
        //                       //  `.\         //   \\          ).         
       //     /\     /\         //     \\       /(     \\        ( |         
      //     ( (  .--) )--.-'\ //______ )\  .--------.  \\        ||         
     //       \ \'  / /------{/_/-'/___}---/          \  \\       ||         
    //        /'' '''/  .-------/__>,          \     ,<\  )\      ||         
   ( )        >@) (@)' /\_/---<__.-'            `-.   //  \ \     ||         
    \\      .<``/ ;,,'')  ___.---'__.----.        (\  \\   \ \    |'         
     \\    {O__O}' )  /.--'_.-' ________,-\        \` ' )   \ \   |          
      \\   (/^^\) /  //_,-'----'    \-.---^----,--' >-  >    \ \  |          
       \\  ,-----/  //   ___LL.----._>-\           (   /\     \ \ |          
        \)'   (\'/)'/`. /.-_          ` >-----.   .-.  )/`.    \ )|          
         `    (_._(/   (/ /_X \--------/,        (|^|_.-.  `.  // |          
              `(T\'     \(<_)__)     .'        .-^(|) |^|    `((  |          
              ._)\\--.   \) ||     ,/  ,      ( X_ V, (|)      \\ |          
             (.--)\-'`\   ` ||   ,'|           `(_>-^-'V)       )\|          
              `\(('`\       |( ,'  |  ,              ` (        \ |          
                 `\         | )    |  @               ) \        )|          
                            |/     `-                / -(        )|          
                            `       `._\            '    `.     / |          
                       _____________(   `---------'___.---<    (  |          
                      /                           /_       \    \ |          
                    .'      _________.  `      .--'         )    \|          
                   (  _,   `              \  .'            /      '          
                    \ `       \__________.-^/      .   -,-'                  
                     \         |          _/  ___.   -' /                    
                      \        ,\        /   _/-------^T                     
                       \        \)    .-'  /(  (     ) |                     
                        \      ` \   (/-/._.'  (_   _) '                     
                         \      \ \  ' /'      (   ' )/                      
                          `.     \<           (`  , )'                       
                            ` .   ))        _(` ,  /                         
                               \_   >    _-' ,   .'                          
                               .'  /   .',  _.--'                            
                         .----' _ (   (/.--'      
                         (-'-._/(_ )  ('                                     
                                (-'

";
    }
}
